Catalogs/СтруктураСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>СтруктураСметы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Структура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Итоговая</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПересчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеРКО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРКО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБазыРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сдвиг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоОплате</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/РаспределениеСтатейПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>РаспределениеСтатейПоМесяцам</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособРаспределенияСуммыПоМесяцам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазоваяСтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СтруктураСметы/Ext/ManagerModule.bsl
// Добавлена директива &НаСервере (Панферов Артем)18.01.18

&НаСервере
Функция Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода ) Экспорт
	// печать технлологичкую форму структуру сметы 
	// печать счёта на оплату
	ГодПроекта = Формат( Год(ПараметрыПечати.ГодПроекта), "ЧЦ=4; ЧГ=0");
	ПодготовитьПечатнуюФорму(
		"РасчетСтруктурыСметы",
		НСтр("ru = 'Расчет структуры сметы задачи проекта в '"+ГодПроекта + "'году'"),
		"",
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		ПараметрыПечати);
	
		
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Ложь;
	

КонецФункции

&НаСервере
Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, ПараметрыПечати)
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		ИмяМакета,
		ПредставлениеМакета,
		ПечатьСтруктурыСметы( МассивОбъектов, ОбъектыПечати, ИмяМакета, ПараметрыПечати),
		,
		ПолныйПутьКМакету);
	КонецЕсли;
	
КонецПроцедуры

// Добавлена директива &НаСервере (Панферов Артем)   18.01.18
&НаСервере
Функция ПечатьСтруктурыСметы(МассивОбъектов, ОбъектыПечати, ИмяМакета = "", ПараметрыПечати) Экспорт
	ТабличныйДокумент 	= Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "РасчетСтруктурыСметы";
	//
	ГодПроекта 		= Год( ПараметрыПечати.ГодПроекта );
	СтруктураСметы 	= УП_СметаПроекта.ПолучитьСтруктуруСметыЗадачи( ГодПроекта );	
	Если СтруктураСметы = Неопределено Тогда
		Сообщить("Структура сметы не определена на указанный год "+ ГодПроекта);
		Возврат ТабличныйДокумент;
	КонецЕсли;
	Макет 				= Справочники.СтруктураСметы.ПолучитьМакет("ПФ_MXL_РасчетСтруктурыСметы");
	
	Обл = Макет.ПолучитьОбласть("Заголовок");
	Обл.Параметры.ГодПроекта = ГодПроекта;
	ТабличныйДокумент.Вывести( Обл );
	
	// по табличной части документа
	Для Каждого СтрСС ИЗ СтруктураСметы Цикл
		
		
		Если СтрСС.Значение.Итоговая Тогда 
			Обл = Макет.ПолучитьОбласть("РасчетИтоговая");
		Иначе
		
			Обл = Макет.ПолучитьОбласть("Расчет");
			СтрРаспределения = РегистрыСведений.РаспределениеСтатейПоМесяцам.ПолучитьПоследнее(ПараметрыПечати.ГодПроекта, Новый Структура("СтатьяСметы", СтрСс.Значение.Статья ));
			ЗаполнитьЗначенияСвойств( Обл.Параметры, СтрРаспределения );
			
		КонецЕсли;
		
		//
		ЗаполнитьЗначенияСвойств( Обл.Параметры, СтрСС.Значение );
		ТабличныйДокумент.Вывести( Обл );
	КонецЦикла;
	
	//
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.Защита				= Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции
